Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: If you are interested in more than just the overall matched range, you want to obtain an NSText Checking Result object corresponding to a given match.
ja: あなたが単にマッチした範囲全体だけでなくより多くのことに興味を持つならば、あなたは与えられたマッチに対応しているNSText Checking Resultオブジェクトを得ることを欲します。

source: If you are interested only in the overall range of the first match, the range Of First Match(in: options: range:) method provides it for you.
ja: あなたが最初のマッチの範囲だけに興味があるならば、range Of First Match(in: options: range:)メソッドがあなたにそれを与えます。

source: If you are moving, copying, linking, or removing files or directories, you can use a delegate in conjunction with a file manager object to manage those operations.
ja: あなたがファイルやディレクトリの移動、コピー、リンク、または削除をしようとするならば、あなたはある委任先をファイルマネージャオブジェクトと連係して使用してそれら操作を管理できます。

source: If you are sorting strings to present to the end user, use String APIs that perform localized comparison instead.
ja: あなたが文字列をソートしてエンドユーザに提供するならば、代わりにString APIを使うべきです、それはローカライズされた比較を実行します。

source: If you are sorting strings to present to the end user, use String APIs that perform localized comparison.
ja: あなたが文字列をソートしてエンドユーザに提供するならば、String APIを使うべきです、それはローカライズされた比較を実行します。

source: If you call the method with an invalid group identifier in iOS, the method returns a nil value.
ja: あなたがメソッドを不正なグループ識別子でiOSにおいて呼び出すならば、メソッドはnil値を返します。

source: If you call the method with an invalid group identifier, namely one for which you do not have an entitlement, the method still returns a URL of the expected form, but the corresponding group directory does not actually exist, nor can your sandboxed app create it.
ja: あなたがメソッドを無効なグループ識別子、言い換えるとそれに対してあなたが資格を持たないもので呼び出すならば、メソッドは依然として期待する形式のURlを返します、しかし対応するグループディレクトリは実際には存在しませんし、あなたのサンドボックスアプリはそれを作成もできません。

source: If you do call the close File() method, subsequent calls to this method raise an exception.
ja: あなたがclose File()メソッド呼び出しを行うならば、このメソッドに対する続いて起こる呼び出しは例外を引き起こします。

source: If you do not assign a value to this string, the formatter object automatically updates the string based on the values in the date Style and time Style properties.
ja: あなたが値をこの文字列に割り当てないならば、フォーマッタオブジェクトはdate Styleおよびtime Styleプロパティに基づいて自動的に文字列を更新します。

source: If you do not implement this method, the file manager assumes a response of false.
ja: あなたがこのメソッドを実装しないならば、ファイルマネージャは応答はfalseだと決めてかかります。

source: If you do not implement this method, the file manager assumes a response of true.
ja: あなたがこのメソッドを実装しないならば、ファイルマネージャは応答はtrueだと決めてかかります。

source: If you do not provide a value for NSHTTPCookie Origin URL, you must provide a value for NSHTTPCookie Domain.
ja: あなたがNSHTTPCookie Origin URLに対して値を提供しないならば、あなたはNSHTTPCookie Domainに対して値を提供しなければなりません。

source: If you do not specify a value for NSHTTPCookie Origin URL, you must specify a value for NSHTTPCookie Domain.
ja: あなたがNSHTTPCookie Origin URLに対して値を指定しないならば、あなたはNSHTTPCookie Domainに対して値を指定しなければなりません。

source: If you do not want to receive error messages, set this parameter to NULL.
ja: あなたがエラーメッセージを受け取ることを望まないならば、このパラメータをNULLに指定してください。

source: If you do use this function directly, you must have prepared the variable argument list in the args argument by calling the standard C macro va_start.
ja: あなたがこの関数を直接に使うならば、あなたは変数引数リストをargs引数の中に、標準C macro va_startを呼び出すことによって用意しておく必要があります。

source: If you do, your initializer must invoke one of the designated initializers of the NSArray class, either init() or init(objects: count:).
ja: あなたがそうするならば、あなたのイニシャライザはNSArrayクラスの指定イニシャライザの１つ、init()またはinit(objects: count:)どちらかを発動しなければなりません。

source: If you find only one object, you should still return its index in an array.
ja: あなたがただ１つのオブジェクトを見つけるならば、あなたはそれでもそのインデックスを配列の中に入れて返すべきです。

source: If you have scriptable objects that need to perform comparisons for scripting purposes, you may need to implement some of the methods declared in NSScriptingComparisonMethods.
ja: スクリプティング目的のために比較の実行が必要なスクリプト対応オブジェクトをあなたが持つならば、あなたはNSScriptingComparisonMethodsにおいて宣言されるメソッドのいくつかを実装する必要があるでしょう。

source: If you implement this method in a non-root class, if your class has nothing to return for the given selector then you should return the result of invoking super’s implementation.
ja: あなたがこのメソッドを非ルートクラスにおいて実装する場合、あなたのクラスが指定されたセレクタに対して返すことが何もないならばその時はあなたはスーパーの実装の発動の結果を返すべきです。

source: If you initialized the file handle object using the init(file Descriptor:) method, or you initialized it using the init(file Descriptor: close On Dealloc:) and passed false for the flag parameter, you can use this method to close the file descriptor; otherwise, you must close the file descriptor yourself.
ja: あなたがファイルハンドルオブジェクトをinit(file Descriptor:)メソッドを使って初期化したならば、またはあなたがそれをinit(file Descriptor: close On Dealloc:)を使って初期化したそしてfalseをflagパラメータに渡したならば、あなたはこのメソッドを使ってファイル記述子を閉じることができます；そうでなければ、あなたはファイル記述子をあなた自身で閉じなければなりません。

source: If you mutate the collection while iterating over its indices, a strong reference can cause an unexpected copy of the collection.
ja: あなたがコレクションをそれのインデックス全体に反復している間に変化させるならば、ある強い参照はそのコレクションの予期されない複製を引き起すことができます。

source: If you need a reversed collection of the same type, you may be able to use the collection’s sequence-based or collection-based initializer.
ja: あなたが同じ型での逆にされたコレクションを必要とするならば、あなたはコレクションのもつシーケンス基盤のまたはコレクション基盤のイニシャライザを使うことができるでしょう。

source: If you need functionality provided by CFBundle, you can still create a CFBundle and use the CFBundle API.
ja: あなたがCFBundleによって提供される機能を必要とするならば、あなたは依然としてCFBundleを作成してCFBundle APIを使うことができます。

source: If you need specific control over the input to or output from the script, use this class.
ja: あなたが特定の制御をスクリプトへのインプットまたはそれからのアウトプットに必要とするならば、このクラスを使ってください。

source: If you need to define a format that cannot be achieved using the predefined styles, you can use the set Localized Date Format From Template(_:) to specify a localized date format from a template.
ja: あらかじめ定義されたスタイルを使ってアーカイブできない書式設定を定義するのをあなたが望むならば、あなたはset Localized Date Format From Template(_:)を使って、ローカライズされた日付書式設定を雛形から指定します。

source: If you need to execute scripts and get the input and output information use the NSUser Unix Task, NSUser Apple Script Task, and NSUser Automator Task sub classes.
ja: あなたがスクリプトを実行して入出力情報を得る必要があるならば、NSUser Unix Task、NSUser Apple Script Task、そしてNSUser Automator Taskサブクラスを使ってください。

source: If you need to further determine whether path is a package, use the is File Package(at Path:) method of NSWorkspace.
ja: あなたがpathがパッケージかどうかをさらに判定する必要があるならば、NSWorkspaceのis File Package(at Path:)メソッドを使ってください。

source: If you need to mutate the returned object, make a copy first and mutate the copy instead.
ja: あなたが返されるオブジェクトを変える必要があるならば、最初にコピーを作って、そしてコピーを代わりに変えてください。

source: If you need to perform a deep enumeration, use the enumerator(at: including Properties For Keys: options: error Handler:) method instead.
ja: 深い列挙の実行を必要とするならば、enumerator(at: including Properties For Keys: options: error Handler:)メソッドを代わりに使ってください。

source: If you need to preserve the user-visible names of attachments, you have to store the names yourself.
ja: あなたが添付書類のユーザ可視な名前を保全する必要があるならば、あなたはその名前をあなた自身で貯蔵しなければなりません。

source: If you need to send Apple events, or if you need more information on some of the Apple event concepts described here, see Apple Events Programming Guide and Apple Event Manager.
ja: あなたがアップルイベントを送る必要があるならば、またはあなたがここで記述されるアップルイベントの概念のいくつかに関する情報をもっと必要とするならば、Apple Event Managerを見てください。

source: If you pass nil, NSDate formats the date in the same way as the description property.
ja: あなたがnilを渡すならば、NSDateは、descriptionプロパティと同じ方法で日付を書式設定します。

source: If you pass nil, Date formats the date in the same way as the description property.
ja: あなたがnilを渡すならば、Dateは、descriptionプロパティと同じ方法で日付を書式設定します。

source: If you pass a value of k Auto Generate Return ID, the Apple Event Manager assigns the created Apple event a return ID that is unique to the current session.
ja: あなたがk Auto Generate Return IDの値を渡すならば、アップルイベントマネージャーは作成されたアップルイベントをリターンIDに代入します、それは現在のセッションに対して特有です。

source: If you pass a zero-length range as the subrange parameter, this method inserts the elements of new Elements at subrange .start Index.
ja: あなたがゼロ長範囲をsubrangeパラメータとして渡すならば、このメソッドはnew Elementsの要素をsubrange .start Indexで挿入します。

source: If you pass any other value, the Apple Event Manager assigns that value for the ID.
ja: あなたが何らかの他の値を渡したならば、アップルイベントマネージャはその値をこのIDに対して割り当てます。

source: If you pass in an NSDictionary object in OS X v10.5, NSDate uses the default user locale—the same as if you passed in [NSLocale current Locale].
ja: あなたがNSDictionaryオブジェクトをOS X 10.5において渡すならば、NSDateは省略時のユーザロケールを使います — あなたが[NSLocale current Locale]を渡した場合と同じ。

source: If you pass the collection’s end Index property as the index parameter, the new element is appended to the collection.
ja: あなたがコレクションのend Indexプロパティをindexパラメータとして渡すならば、新しい要素がコレクションに追加されます。

source: If you pass the collection’s end Index property as the index parameter, the new elements are appended to the collection.
ja: あなたがコレクションのend Indexプロパティをindexパラメータとして渡すならば、いくらかの新しい要素がコレクションに追加されます。

source: If you plan to use a delegate with the file manager to receive notifications about the completion of file-based operations, you should create a new instance of File Manager (using the init method) rather than using the shared object.
ja: あなたがある委任先をファイルマネージャとともに使って、ファイルに基づく操作の完了について通知を受け取ることを計画するならば、あなたは共有オブジェクトを使う代わりに、File Managerの新しいインスタンスを作成すべきです（initを使って）。

source: If you return true, the file manager continues copying any other items and ignores the error.
ja: あなたがtrueを返すならば、ファイルマネージャは何らかの他の項目をコピーすることを継続します、そしてエラーを無視します。

source: If you return true, the file manager continues creating any other links associated with the current operation and ignores the error.
ja: あなたがtrueを返すならば、ファイルマネージャは現在の操作と結び付けられた何らかの他のリンクを作成することを継続します、そしてエラーを無視します。

source: If you return true, the file manager continues deleting any remaining items and ignores the error.
ja: あなたがtrueを返すならば、ファイルマネージャは何らかの残っている項目を消去することを継続します、そしてエラーを無視します。

source: If you return true, the file manager proceeds to remove the item from its current location as if the move operation had completed successfully.
ja: あなたがtrueを返すならば、ファイルマネージャは項目のそれの現在の場所からの除去を続行します、あたかも移動操作が上手く完了したかのように。

source: If you return false and assign a new string to partial String Ptr and a new range to proposed Sel Range Ptr, the string and selection range are changed, otherwise, if no values are assigned to partial String Ptr or proposed Sel Range Ptr, the change is rejected.
ja: あなたがfalseを返して新しい文字列をpartial String Ptrにそして新しい範囲をproposed Sel Range Ptr割り当てるならば、文字列と選択範囲は変更されます、そうではなくて、値がpartial String Ptrまたはproposed Sel Range Ptrに割り当てられないならば、変更は却下されます。

source: If you return false and new String is nil, the cell displays partial String minus the last character typed.
ja: あなたがfalseを返すそしてnew Stringがnilならば、セルはpartial Stringからタイプされた最後の文字を引いたものを返します。

source: If you return false, you can also return by indirection an NSString object (in error) that explains the reason why the validation failed; the delegate (if any) of the NSControl object managing the cell can then respond to the failure in control:didFailToValidatePartialString:errorDescription:.
ja: あなたがfalseを返すならば、あなたはまた遠回しにNSStringオブジェクトを（errorにおいて）返すことができます、それはなぜ検証が失敗したか理由を説明するものです；セルを管理するNSControlオブジェクトの委任先（もしあれば）は、そのとき control:didFailToValidatePartialString:errorDescription: での失敗に応答できます。

source: If you return false, also return by indirection (in error) a localized user-presentable NSString object that explains the reason why the conversion failed; the delegate (if any) of the NSControl object managing the cell can then respond to the failure in control:didFailToFormatString:errorDescription:.
ja: あなたがfalseを返すならば、また遠回しに（errorにおいて）ローカライズされたユーザに提示可能なNSStringオブジェクトを返してください、それはなぜ変換が失敗したか理由を説明するものです；セルを管理するNSControlオブジェクトの委任先（もしあれば）は、そのとき control:didFailToFormatString:errorDescription: での失敗に応答できます。

source: If you simply need to execute scripts without regard to input or output, use NSUser Script Task, which can execute any of the specific types.
ja: あなたがインプットやアウトプットを考慮せずに簡単なスクリプトの実行を必要とするならば、NSUser Script Taskを使ってください、それはどんな特殊な種類でも実行できます。

source: If you sorted a large array (N entries) once, and you don’t change it much (P additions and deletions, where P is much smaller than N), then you can reuse the work you did in the original sort by conceptually doing a merge sort between the N “old” items and the P “new” items.
ja: あなたがある大きな配列（N個の登録項目）を一旦ソートしたならば、そしてあなたがそれをほとんど変更しないならば（P個の追加と削除、ここでPはNよりはるかに少ない）、そのときあなたは、あなたが元のソートにおいて行った作業を再利用することが、概念的にNの「旧」項目とPの「新」項目間のマージソートの実行によって可能です。

source: If you specify nil for attributes, default values for these attributes are set (particularly write access for the creator and read access for others).
ja: あなたがnilをattributesに指定するならば、それら属性に対する省略時が設定されます（とりわけクリエーターに対する書き込みアクセスと他のものに対する読み出しアクセス）。

source: If you specify nil for the attributes parameter, this method uses a default set of values for the owner, group, and permissions of any newly created directories in the path.
ja: あなたがnilをattributesパラメータに指定するならば、このメソッドは省略時のひとそろいの値をパスにおいてあらゆる新しく作成されるディレクトリの所有者、グループ、そして権限に対して設定します。

source: If you specify nil for this parameter or omit a particular value, one or more default values are used as described in the discussion.
ja: あなたがnilをこのパラメータに指定するか特定の値を省くならば、１つ以上の省略時の値が、議論において記述されるように使用されます。

source: If you specify nil for this parameter, the directory is created according to the umask(2) macOS Developer Tools Manual Page of the process.
ja: あなたがnilをこのパラメータに指定するならば、ディレクトリは、このプロセスのmacOS Developer Tools Manual Page umask(2) により作成されます。

source: If you specify nil for this parameter, this method returns the first container listed in the com .apple .developer .ubiquity-container-identifiers entitlement array.
ja: あなたがnilをこのパラメータに指定するならば、このメソッドはcom .apple .developer .ubiquity-container-identifiers資格配列において一覧にされる最初のコンテナを返します。

source: If you specify nil or an empty array for this parameter, this method returns without performing the specified selector.
ja: あなたがnilまたは空の配列をこのパラメータに指定するならば、このメソッドは指定されたセレクタを実行することなく返ります。

source: If you specify nil, the method returns the first resource file it finds that matches the remaining criteria.
ja: あなたがnilを指定するならば、このメソッドは、それが最初に見つける、残りの基準に合致するリソースファイルを返します。

source: If you specify nil, the method returns the first resource file it finds with the specified extension.
ja: あなたがnilを指定するならば、このメソッドは、それが最初に見つける、指定された拡張子を持つリソースファイルを返します。

source: If you specify nil for attributes, the file is created with a set of default attributes.
ja: あなたがnilをattributesに指定するならば、ファイルは一揃いの省略時の属性で作成されます。

source: If you specify an empty string or nil, all the files in subpath and its subdirectories are returned.
ja: あなたが空の文字列またはnilを指定するならば、subpathとそれの下位ディレクトリの中の全てのファイルが返されます。

source: If you specify an empty string or nil, the extension is assumed not to exist and all of the files in subpath are returned.
ja: あなたが空の文字列またはnilを指定するならば、拡張子は存在しないとみなされます、subpathの中の全てのファイルが返されます。

source: If you specify an empty string or nil, the extension is assumed not to exist and the file is the first file encountered that exactly matches name.
ja: あなたが空の文字列またはnilを指定するならば、拡張子は存在しないとみなされます、そしてファイルは最初に出くわしたぴったりnameに一致するファイルです。

source: If you specify both first Equal and last Equal, throws an NSInvalid Argument Exception.
ja: あなたがfirst Equalとlast Equalを両方とも指定するならば、NSInvalid Argument Exceptionをスローします。

source: If you specify different modes for each selector, any selectors whose associated mode does not match the current run loop mode are skipped until the run loop subsequently executes in that mode.
ja: あなたが異なるモードをそれぞれのセレクタに指定するならば、それと結びつけられたモードが現在の実行ループモードと一致しないあらゆるセレクタは、実行ループが後でそのモードで実行されるまでスキップされます。

source: If you stored or archived the previous token, compare that token to the newly obtained one using the is Equal(_:) method to determine if the users are the same or different.
ja: あなたが以前のトークンを格納またはアーカイブしたならば、そのトークンと新しく得られたものをis Equal(_:)メソッドを使って比較して、ユーザが同じか違うを決定してください。

source: If you use the C string beyond the scope of the current autorelease pool, you must copy it.
ja: あなたがこのC文字列を現在のオートリリースプールのスコープを越えて使用するならば、あなたはそれをコピーすべきです。

source: If you use this method to create a temporary directory, you should not rely on the existence of that temporary directory after the app is exited.
ja: あなたがこのメソッドを使って一時ディレクトリを作成するならば、あなたはその一時ディレクトリの存続をアプリが終了させられた後に当てにすべきではありません。

source: If you want directory contents to have default set of pre-fetched file properties, pass nil to this parameter.
ja: あなたがディレクトリ内容に省略時の一揃いの事前読込みファイルプロパティを望むならば、nilをこのパラメータに渡してください。

source: If you want directory contents to have no pre-fetched file properties, pass an empty array to this parameter.
ja: あなたがディレクトリ内容にファイルプロパティの事前読込みを望まないならば、空の配列をこのパラメータに渡してください。

source: If you want the file handle object to close the descriptor for you automatically, pass true for the flag parameter.
ja: あなたがファイルハンドルオブジェクトにあなたの代わりに自動的に記述子を閉じてほしいならば、trueをflagパラメータに渡してください。

source: If you want to be semantically compatible with NSInput Stream, return true if a read must be attempted to determine if bytes are available.
ja: あなたがNSInput Streamと意味論の互換性があってほしいならば、trueをバイトが利用可能か決定するために読み出しが試みられなければならないならば返してください。

source: If you want to direct output elsewhere, you need to use a custom logging facility.
ja: あなたが直接にどこか他に出力したいならば、あなたはあつらえのログ機能を使う必要があります。

source: If you want to keep getting notified, you need to call accept Connection In Background And Notify() again in your observer method.
ja: あなたが通知され続けたいならば、あなたはaccept Connection In Background And Notify()を再びあなたのオブザーバメソッドにおいて呼び出す必要があります。

source: If you want to protect yourself from being run multiple times, you can structure your implementation along these lines:
ja: あなたが複数回実行されることから身を守りたいならば、あなたはこれらの行に沿ってあなたの実装を組織立てることができます：

source: If you want to sort the cookie storage’s cookies, you should use the sorted Cookies(using:) method instead of sorting the result of this method.
ja: あなたがクッキーストレージの持つクッキーをソートしたいならば、あなたはsorted Cookies(using:)メソッドを使うべきです、このメソッドの結果をソートする代わりに。

source: If you want to specify a relative path for url, you must set the current working directory before creating the corresponding NSURL object.
ja: あなたが相対パスをurlに指定したいならば、あなたは現在の作業ディレクトリを設定しなければなりません、対応するNSURLオブジェクトを作成する前にです。

source: If you want to specify a relative path, you must set the current working directory before creating the corresponding NSURL object.
ja: あなたが相対パスを指定したいならば、あなたは現在の作業ディレクトリを設定しなければなりません、対応するNSURLオブジェクトを作成する前にです。

source: If you want to use a file handle object with a file descriptor that you created, use the init(file Descriptor:) method or use the init(file Descriptor: close On Dealloc:) method and pass false for the flag parameter.
ja: あるファイルハンドルオブジェクトをあなたが作成したファイル記述子とともに使うことを望むならば、init(file Descriptor:)メソッドを使ってください、またはinit(file Descriptor: close On Dealloc:)メソッドを使ってfalseをflagパラメータを渡してください。

source: If you want “date information in a given time zone” in order to display it, you should use Date Formatter to format the date.
ja: あなたが「与えられたタイムゾーンの中の日付情報」をそれを表示するために望むならば、あなたはDate Formatterを使って日付を書式設定すべきです。

source: If you will be adding a known number of elements to a collection, use this method to avoid multiple reallocations.
ja: あなたが数のわかった要素をコレクションに加えることになっているならば、このメソッドを使って複数の再割り当てを避けてください。

source: If you wish to add calendrical concepts like hours, days, months then you must use a Calendar.
ja: あなたが、いくらかの時間、日にち、月といったカレンダー概念を加えることを願うならば、そのときあなたはCalendarを使う必要があります。

source: If you wish to find the next Feb 29 without the algorithm adjusting the next higher component in the specified Date Components, then use the strict option.
ja: 指定されたDate Componentsの中の次により高位の構成要素をアルゴリズムが調整することなしに、あなたが次の２月29日を見つけるのを望むならば、そのときstrictオプションを使ってください。

source: If you wish to keep getting notified, you’ll also need to call read In Background And Notify() in your observer method.
ja: あなたが通知され続けるのを願うならば、あなたはまたread In Background And Notify()をあなたのオブザーバメソッドにおいて呼び出す必要があります。

source: If you wish to receive a localized answer, be sure to set the locale property first - most likely to Locale .autoupdating Current.
ja: あなたがローカライズされた答えを受け取るのを望むならば、最初にlocaleプロパティを - 十中八九はLocale .autoupdating Currentに - 設定することを確実にしてください。

source: If your app accesses multiple ubiquity containers, call this method once for each container.
ja: あなたのアプリが複数の偏在コンテナにアクセスするならば、このメソッドを各コンテナに対して一回呼び出してください。

source: If your app interacts directly with plug-ins, frameworks, or other bundled content, you can use other methods of this class to create appropriate bundle objects.
ja: あなたのアプリがプラグイン、フレームワーク、または他のバンドルされる内容と直接に相互作用するならば、あなたはこのクラスの他のメソッドを使って適切なバンドルオブジェクトを作成できます。

source: If your app is presenting the file’s contents to the user, it must have an active file presenter object configured to monitor the specified file or directory before calling this method.
ja: あなたのアプリがファイルの内容をユーザに提示するならば、このメソッドを呼び出す前に、それは指定されたファイルやディレクトリを監視するために構成設定されたアクティブなファイルプレゼンタオブジェクトを持たなければなりません。

source: Ignore whitespace and #-prefixed comments in the pattern.
ja: パターンにおいて空白と#接頭辞をつけられたコメントを無視します。

source: Image resources are those files in the bundle that are recognized by the NSImage class, including those that can be converted using the Image IO framework.
ja: 画像リソースは、Image IOフレームワークを使って変換されるようなものを含む、NSImageクラスによって認識されるような種類の、バンドルの中のファイルです。

source: Images requested using this method whose name ends in the word Template are automatically marked as template images.
ja: このメソッドを使って要求された、それの名前が単語Templateで終わる画像は、自動的に雛形画像として印されます。

source: Implement this block to retrieve the error of the script executed by execute(completion Handler:).
ja: このブロックを実装して、execute(completion Handler:)によって実行されるスクリプトのエラーを回収してください。

source: Implement this block to retrieve the result of the AppleScript executed by execute(with Apple Event: completion Handler:).
ja: 実行されたAppleScriptの結果をexecute(with Apple Event: completion Handler:)によって回収するには、このブロックを実装してください。

source: Implementations of the forward Invocation: method can do more than just forward messages.
ja: forward Invocation:メソッドの実装は、ただメッセージを転送するよりも多くのことができます。

source: Implemented by subclasses to initialize a new object (the receiver) immediately after memory for it has been allocated.
ja: サブクラスによって実装されて、新しいオブジェクト（レシーバ）を、それのためのメモリが割り当てられた直後に初期化します。

source: Important
ja: 重要

source: In OS X 10.3 and earlier, Cocoa scripting did not invoke set Value(_: for Key:) or mutable Array Value(for Key:), so automatic key-value observing notification was not always done for model object changes caused by scripts.
ja: OS X 10.3以前では、Cocoaスクリプティングはset Value(_: for Key:)またはmutable Array Value(for Key:)を発動しません、それで自動キー値監視通知はスクリプトによって引き起こされるモデルオブジェクト変更に対して必ずしも行われませんでした。

source: In OS X v10.4 and earlier, locale Dictionary is an NSDictionary object containing locale data.
ja: OS X 10.4以前では、locale Dictionaryはロケールデータを含んでいるNSDictionaryオブジェクトです。

source: In OS X v10.4 and earlier, this parameter was an NSDictionary object.
ja: OS X 10.4以前では、このパラメータはNSDictionaryオブジェクトでした。

source: In Swift, this API is imported as an initializer and is marked with the throws keyword to indicate that it throws an error in cases of failure.
ja: Swiftでは、このAPIはイニシャライザとしてインポートされてthrowsキーワードで印されることで、それが様々な失敗においてエラーをスローすることを指し示します。

source: In Swift, this method returns Void and is marked with the throws keyword to indicate that it throws an error in cases of failure.
ja: Swiftでは、このメソッドはVoidを返して、失敗の場合にエラーをスローすることを指し示すためにthrowsキーワードで印されます。

source: In Swift, this method returns a nonoptional result and is marked with the throws keyword to indicate that it throws an error in cases of failure.
ja: Swiftでは、このメソッドは非オプショナルの結果を返します、そしてthrowsキーワードで印されて失敗の場合にそれがエラーをスローすることを指し示します。

source: In a managed memory environment, this is instead of the retain message the object would otherwise receive.
ja: 管理されたメモリ環境では、これは、そうでなければオブジェクトが受け取るであろうretainメッセージの代わりです。
